// 디자인 패턴 과정입니다.
// github.com/codenuri/ssdp   에 접속하시면
// 1일차 사전 소스 받으실수 있습니다.

// 강석민 강사 (smkang@codenuri.co.kr)

// 실습 환경 : visual studio 2017 이상 버전
//			 또는 표준 C++을 컴파일 할수 있는 환경..
//			 강사는 vs2022 사용합니다.

// 강의 주요 내용

// 1일차 오전 : 디자인 패턴을 이해하기 위해 알아야 하는 C++문법
// 객체지향 디자인 패턴과 다양한 오픈소스가 사용하는 디자인 기술들..
// 
// C++문법 : C++11의 일부내용사용(auto, range for 등)


// 출석 : www.codexpert.org 에서 "손들기"로 출석.. 
//       


// github.com/codenuri/ssdp

// 1일차 압축 풀고 VC 에서 열어 보세요..
// 1. VC 실행
// 2. 파일 - 프로젝트 열기 선택- .sln 또는 .vcproj 파일열기 

// 3. 버전 맞춰야 에러 없습니다.
//    프로젝트 메뉴 - DAY 속성 메뉴선택. 
//    "모든구성" - "모든 플랫폼"으로 맞춘후
//    "플랫폼 도구집합", "Windows SDK" 버전 맞춰 주세요

// 4. VC 빌드 환경은 "Debug", "x86" 으로 설정 합니다

// 5. 파일을 빌드에서 제거/포함 하는 방법. 